# Velocity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData..::..Velocity Property
MEPNetworkSegmentData Class See Also
---
The calculated velocity of this segment, in ft/s.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public double Velocity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Velocity As Double
	Get
```

Visual C++
---
```text
public:
property double Velocity {
	double get ();
}
```

# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace